app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
    def show
        @post = Post.find{|post| post.id.to_s == params[:id] }